app/controllers/happiness_controller.rb

SELECT "happinesses".* FROM "happinesses" WHERE "happinesses"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def show
    @happiness = Happiness.find(params[:id])