app/controllers/welcome_controller.rb

  def index
    @happiness_samples = Happiness.order("RANDOM()").limit(5) # Выберите нужное количество записей
---
SELECT "happinesses".* FROM "happinesses" ORDER BY RANDOM() LIMIT ?  [["LIMIT", 5]]